# Longest Common Prefix
# Difficulty: Easy
# Runtime: 3 ms
# Memory: 12.5 MB
# https://leetcode.com/problems/longest-common-prefix/

class·‌Solution(object):
·‌·‌·‌·‌def·‌longestCommonPrefix(self,·‌strs):
·‌·‌·‌·‌·‌·‌·‌·‌"""
·‌·‌·‌·‌·‌·‌·‌·‌:type·‌strs:·‌List[str]
·‌·‌·‌·‌·‌·‌·‌·‌:rtype:·‌str
·‌·‌·‌·‌·‌·‌·‌·‌"""
·‌·‌·‌·‌·‌·‌·‌·‌s·‌=·‌len(strs)
·‌·‌·‌·‌·‌·‌·‌·‌if·‌not·‌strs:
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌return·‌""

·‌·‌·‌·‌·‌·‌·‌·‌first·‌=·‌min(strs)
·‌·‌·‌·‌·‌·‌·‌·‌last·‌=·‌max(strs)

·‌·‌·‌·‌·‌·‌·‌·‌i·‌=·‌0
·‌·‌·‌·‌·‌·‌·‌·‌while·‌i·‌<len(first)·‌and·‌i·‌<len(last)·‌and·‌first[i]·‌==last[i]:
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌i+=1
·‌·‌·‌·‌·‌·‌·‌·‌
·‌·‌·‌·‌·‌·‌·‌·‌return·‌first[:i]

